[
  {
    "text": "Arrange the sentences to form a coherent paragraph.\nA. The barangay began organizing volunteers for nightly patrols.\nB. Recently, reports of petty theft have increased in the community.\nC. These efforts aim to create a safer neighborhood for residents.\nD. In response, officials implemented additional safety measures.",
    "explanation": "Correct order: B → D → A → C.",
    "choices": [
      { "text": "BDAC", "is_correct": true },
      { "text": "DACB", "is_correct": false },
      { "text": "ABDC", "is_correct": false },
      { "text": "CBAD", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence is the best topic sentence for a paragraph about conserving water at home?",
    "explanation": "The topic sentence should introduce the importance of water conservation.",
    "choices": [
      {
        "text": "Conserving water at home is essential to reducing overall consumption.",
        "is_correct": true
      },
      {
        "text": "Some households wash their cars every weekend.",
        "is_correct": false
      },
      { "text": "Water bills vary depending on usage.", "is_correct": false },
      {
        "text": "Many areas experience heavy rainfall during the rainy season.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Which sentence should logically come LAST in a paragraph explaining how to make hot chocolate?",
    "explanation": "The final step is serving the drink.",
    "choices": [
      {
        "text": "Heat the mixture while stirring continuously.",
        "is_correct": false
      },
      {
        "text": "Add cocoa powder and sugar into a pot of milk.",
        "is_correct": false
      },
      {
        "text": "Pour the hot chocolate into a mug and enjoy.",
        "is_correct": true
      },
      { "text": "Gather all the necessary ingredients.", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence does NOT belong in a paragraph about the benefits of volunteering?",
    "explanation": "A statement about movie tickets is irrelevant to volunteering.",
    "choices": [
      {
        "text": "Volunteering helps individuals develop new skills.",
        "is_correct": false
      },
      {
        "text": "It provides opportunities to meet new people.",
        "is_correct": false
      },
      {
        "text": "Some movie theaters offer discounted tickets on weekdays.",
        "is_correct": true
      },
      {
        "text": "Helping others can increase a person’s sense of purpose.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Arrange the sentences to create a well-organized paragraph.\nA. First, stretch your muscles before starting any activity.\nB. Staying physically active is important for maintaining good health.\nC. Finally, cool down with light movements once finished.\nD. After warming up, proceed with your main workout routine.",
    "explanation": "Correct order: B → A → D → C.",
    "choices": [
      { "text": "BADC", "is_correct": true },
      { "text": "ADBC", "is_correct": false },
      { "text": "BDAC", "is_correct": false },
      { "text": "CABD", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence is the best concluding sentence for a paragraph about proper waste segregation?",
    "explanation": "The conclusion should emphasize the overall benefit.",
    "choices": [
      {
        "text": "Proper waste segregation helps protect the environment and public health.",
        "is_correct": true
      },
      {
        "text": "Some households use different colored trash bins.",
        "is_correct": false
      },
      {
        "text": "Many people generate large amounts of garbage daily.",
        "is_correct": false
      },
      { "text": "Not all waste is biodegradable.", "is_correct": false }
    ]
  },
  {
    "text": "Arrange the sentences in the most logical order.\nA. These devices have made communication faster and more convenient.\nB. Mobile phones have become essential tools in everyday life.\nC. Many people use them for messaging, calling, and online activities.\nD. As a result, society has become more digitally connected.",
    "explanation": "Correct order: B → C → A → D.",
    "choices": [
      { "text": "BCAD", "is_correct": true },
      { "text": "CBAD", "is_correct": false },
      { "text": "ACBD", "is_correct": false },
      { "text": "BDAC", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence does NOT belong in a paragraph describing the steps to renew an ID?",
    "explanation": "Going to the grocery store is unrelated to renewing an ID.",
    "choices": [
      {
        "text": "Bring all necessary documents to the renewal center.",
        "is_correct": false
      },
      { "text": "Fill out the renewal form completely.", "is_correct": false },
      {
        "text": "Go to the grocery store to buy supplies.",
        "is_correct": true
      },
      { "text": "Pay the required renewal fee.", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence is the best topic sentence for a paragraph about healthy eating habits?",
    "explanation": "A topic sentence should introduce healthy eating generally.",
    "choices": [
      {
        "text": "Healthy eating habits play a vital role in maintaining overall wellness.",
        "is_correct": true
      },
      { "text": "Many people enjoy eating fast food.", "is_correct": false },
      {
        "text": "Some restaurants offer vegetarian meals.",
        "is_correct": false
      },
      { "text": "Food prices vary per location.", "is_correct": false }
    ]
  },
  {
    "text": "Arrange the sentences to form a logical paragraph.\nA. Many students struggle to balance schoolwork and leisure activities.\nB. Others use planners and calendars to organize their schedule.\nC. To manage their time better, some students create daily task lists.\nD. Developing these habits helps them achieve academic success.",
    "explanation": "Correct order: A → C → B → D.",
    "choices": [
      { "text": "ACBD", "is_correct": true },
      { "text": "BCAD", "is_correct": false },
      { "text": "CABD", "is_correct": false },
      { "text": "ABDC", "is_correct": false }
    ]
  },

  {
    "text": "Which sentence should come FIRST in a paragraph explaining how to submit an online form?",
    "explanation": "First step is accessing the correct website.",
    "choices": [
      {
        "text": "Click the submit button and wait for confirmation.",
        "is_correct": false
      },
      {
        "text": "Fill in all the required fields in the form.",
        "is_correct": false
      },
      {
        "text": "Visit the website where the form is located.",
        "is_correct": true
      },
      { "text": "Upload the necessary documents.", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence should logically come LAST in a paragraph about cleaning a room?",
    "explanation": "The final step is disposing of the collected trash.",
    "choices": [
      {
        "text": "Organize items and return them to their proper places.",
        "is_correct": false
      },
      { "text": "Sweep and mop the floor thoroughly.", "is_correct": false },
      {
        "text": "Throw away all the trash you've collected.",
        "is_correct": true
      },
      {
        "text": "Gather all the materials needed for cleaning.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Which sentence does NOT belong in a paragraph about the history of transportation?",
    "explanation": "A sentence about baking bread is irrelevant.",
    "choices": [
      {
        "text": "Early vehicles were pulled by animals such as horses.",
        "is_correct": false
      },
      {
        "text": "The invention of the steam engine revolutionized travel.",
        "is_correct": false
      },
      {
        "text": "Bread is usually baked in an oven at high temperatures.",
        "is_correct": true
      },
      {
        "text": "Modern transportation includes cars, trains, and airplanes.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Arrange the sentences into a coherent paragraph.\nA. These plants help regulate the temperature inside the building.\nB. Green roofs are becoming popular in urban areas.\nC. They also absorb rainwater, reducing flood risks.\nD. As a result, cities benefit from improved environmental resilience.",
    "explanation": "Correct order: B → A → C → D.",
    "choices": [
      { "text": "BACD", "is_correct": true },
      { "text": "ABCD", "is_correct": false },
      { "text": "BCDA", "is_correct": false },
      { "text": "CBAD", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence is the best concluding sentence for a paragraph about maintaining online privacy?",
    "explanation": "A concluding sentence should summarize the importance of protecting information.",
    "choices": [
      {
        "text": "Therefore, practicing online privacy ensures personal information remains secure.",
        "is_correct": true
      },
      {
        "text": "Many websites require users to create accounts.",
        "is_correct": false
      },
      {
        "text": "Some users forget their passwords easily.",
        "is_correct": false
      },
      {
        "text": "Computers today run much faster than before.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Which sentence should come FIRST in a paragraph about preparing a travel itinerary?",
    "explanation": "Planning starts with deciding your destination.",
    "choices": [
      {
        "text": "Reserve accommodations and transportation.",
        "is_correct": false
      },
      { "text": "Identify the places you want to visit.", "is_correct": false },
      { "text": "Choose your travel destination.", "is_correct": true },
      { "text": "List the activities you want to do.", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence best serves as the topic sentence for a paragraph about digital literacy?",
    "explanation": "Topic sentence must introduce understanding technology as the core idea.",
    "choices": [
      {
        "text": "Digital literacy is essential for navigating modern technology effectively.",
        "is_correct": true
      },
      {
        "text": "Some people enjoy using social media daily.",
        "is_correct": false
      },
      {
        "text": "Many users forget to update their applications.",
        "is_correct": false
      },
      {
        "text": "Phones today are faster than older models.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Arrange the sentences to build a logical paragraph.\nA. This allows customers to buy products without leaving their homes.\nB. Online shopping has become increasingly popular.\nC. Delivery services then bring the purchased items to their doorsteps.\nD. Customers can browse items and place orders through websites.",
    "explanation": "Correct order: B → D → A → C.",
    "choices": [
      { "text": "BDAC", "is_correct": true },
      { "text": "DACB", "is_correct": false },
      { "text": "ABCD", "is_correct": false },
      { "text": "CBAD", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence does NOT belong in a paragraph about earthquake preparedness?",
    "explanation": "A sentence about cooking rice is irrelevant.",
    "choices": [
      {
        "text": "Prepare an emergency kit with essential supplies.",
        "is_correct": false
      },
      {
        "text": "Know the safe spots in your home where you can take cover.",
        "is_correct": false
      },
      {
        "text": "Rice cooks faster when soaked before boiling.",
        "is_correct": true
      },
      {
        "text": "Create a family emergency communication plan.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Which sentence should logically come LAST in a paragraph describing how to mail a letter?",
    "explanation": "The final step is dropping the mail at the post office.",
    "choices": [
      {
        "text": "Place the letter inside an envelope and seal it.",
        "is_correct": false
      },
      {
        "text": "Write the complete address of the recipient.",
        "is_correct": false
      },
      {
        "text": "Bring the letter to the post office and send it.",
        "is_correct": true
      },
      { "text": "Attach the correct amount of postage.", "is_correct": false }
    ]
  },
  {
    "text": "Which arrangement of sentences forms a clear and logical paragraph?\n\nA. Public service requires integrity and accountability.\nB. Government employees are expected to serve the public honestly.\nC. This principle helps maintain public trust in government institutions.\nD. Integrity ensures that public officials act in the best interest of citizens.",
    "explanation": "The paragraph should begin with a general idea, followed by explanation and supporting details, and end with a conclusion. Sentence A introduces the topic, B and D explain it, and C concludes the idea.",
    "choices": [
      { "text": "A-B-D-C", "is_correct": true },
      { "text": "B-A-D-C", "is_correct": false },
      { "text": "A-D-C-B", "is_correct": false },
      { "text": "D-B-A-C", "is_correct": false }
    ]
  },
  {
    "text": "Choose the best sentence order.\n\nA. These disasters often disrupt livelihoods and infrastructure.\nB. The Philippines is frequently affected by natural disasters.\nC. Typhoons, earthquakes, and volcanic eruptions occur regularly.\nD. Preparedness and resilience are therefore essential for communities.",
    "explanation": "Sentence B introduces the topic, C provides examples, A explains the impact, and D presents a conclusion.",
    "choices": [
      { "text": "B-C-A-D", "is_correct": true },
      { "text": "C-B-A-D", "is_correct": false },
      { "text": "B-A-C-D", "is_correct": false },
      { "text": "A-B-C-D", "is_correct": false }
    ]
  },
  {
    "text": "Arrange the sentences to form a coherent paragraph.\n\nA. Reading regularly improves vocabulary and comprehension.\nB. It also enhances critical thinking skills.\nC. Reading is considered one of the most beneficial habits.\nD. As a result, readers are better equipped to analyze information.",
    "explanation": "Sentence C introduces the topic, A and B explain the benefits, and D summarizes the outcome.",
    "choices": [
      { "text": "C-A-B-D", "is_correct": true },
      { "text": "A-B-C-D", "is_correct": false },
      { "text": "C-B-A-D", "is_correct": false },
      { "text": "B-A-C-D", "is_correct": false }
    ]
  },
  {
    "text": "Select the correct order of sentences.\n\nA. Proper waste management helps reduce environmental pollution.\nB. Segregation of waste allows recyclable materials to be reused.\nC. It also minimizes health risks caused by improper disposal.\nD. Effective waste management is a shared responsibility.",
    "explanation": "Sentence D introduces the broad idea, A explains its importance, and B and C provide supporting details.",
    "choices": [
      { "text": "D-A-B-C", "is_correct": true },
      { "text": "A-D-B-C", "is_correct": false },
      { "text": "D-B-A-C", "is_correct": false },
      { "text": "B-A-D-C", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence order forms a well-organized paragraph?\n\nA. This technology has transformed how people communicate.\nB. The internet connects millions of users worldwide.\nC. It allows instant access to information and services.\nD. As a result, communication has become faster and more efficient.",
    "explanation": "Sentence B introduces the subject, A and C explain its effects, and D concludes the idea.",
    "choices": [
      { "text": "B-A-C-D", "is_correct": true },
      { "text": "A-B-C-D", "is_correct": false },
      { "text": "B-C-A-D", "is_correct": false },
      { "text": "C-B-A-D", "is_correct": false }
    ]
  },
  {
    "text": "Choose the correct sentence sequence.\n\nA. Exercise helps improve both physical and mental health.\nB. Regular physical activity strengthens the heart and muscles.\nC. It also reduces stress and improves mood.\nD. Maintaining an active lifestyle is therefore highly recommended.",
    "explanation": "Sentence A introduces the main idea, B and C support it, and D provides a conclusion.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-A-C-D", "is_correct": false },
      { "text": "A-C-B-D", "is_correct": false },
      { "text": "C-B-A-D", "is_correct": false }
    ]
  },
  {
    "text": "Arrange the sentences logically.\n\nA. Education plays a vital role in national development.\nB. It equips citizens with knowledge and skills.\nC. These skills help individuals contribute productively to society.\nD. A strong educational system supports economic growth.",
    "explanation": "Sentence A introduces the topic, B and C explain how education helps individuals, and D connects it to national development.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-C-A-D", "is_correct": false },
      { "text": "A-C-B-D", "is_correct": false },
      { "text": "D-A-B-C", "is_correct": false }
    ]
  },
  {
    "text": "Select the best paragraph arrangement.\n\nA. Time management helps individuals accomplish tasks efficiently.\nB. Planning daily activities reduces stress and missed deadlines.\nC. It allows people to prioritize important responsibilities.\nD. Effective time management leads to better productivity.",
    "explanation": "Sentence A introduces the idea, B and C explain how it works, and D summarizes the benefit.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-C-A-D", "is_correct": false },
      { "text": "C-A-B-D", "is_correct": false },
      { "text": "A-C-D-B", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence order creates a coherent paragraph?\n\nA. Technology continues to evolve rapidly.\nB. New innovations influence how people work and live.\nC. These changes require individuals to adapt continuously.\nD. Lifelong learning has therefore become increasingly important.",
    "explanation": "Sentence A introduces the topic, B explains its impact, C discusses the consequence, and D concludes with a solution.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-A-C-D", "is_correct": false },
      { "text": "A-C-B-D", "is_correct": false },
      { "text": "C-B-A-D", "is_correct": false }
    ]
  },
  {
    "text": "Choose the correct sentence sequence.\n\nA. Voting is a fundamental right in a लोकत democratic society.\nB. It allows citizens to participate in governance.\nC. Through elections, leaders are chosen by the people.\nD. This process strengthens democracy and accountability.",
    "explanation": "Sentence A introduces the main idea, B and C explain how voting works, and D highlights its importance.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-C-A-D", "is_correct": false },
      { "text": "C-B-A-D", "is_correct": false },
      { "text": "A-C-B-D", "is_correct": false }
    ]
  },
  {
    "text": "Arrange the sentences into a clear and organized paragraph.\nA. Many communities rely on these crops for livelihood.\nB. Agriculture remains a major sector in the Philippine economy.\nC. Farmers grow rice, corn, coconuts, and other products.\nD. These crops are then distributed to different markets across the country.",
    "explanation": "Correct order: B → C → A → D.",
    "choices": [
      { "text": "BCAD", "is_correct": true },
      { "text": "CABD", "is_correct": false },
      { "text": "ABCD", "is_correct": false },
      { "text": "DCAB", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence is the best concluding sentence for a paragraph on studying regularly?",
    "explanation": "Conclusion must summarize the value of consistency.",
    "choices": [
      {
        "text": "Thus, consistent study habits lead to better learning and retention.",
        "is_correct": true
      },
      {
        "text": "Some students prefer studying at night.",
        "is_correct": false
      },
      {
        "text": "Exams are usually given at the end of the semester.",
        "is_correct": false
      },
      {
        "text": "Libraries provide a quiet place to read.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Which sentence should come FIRST in a paragraph about preparing for a typhoon?",
    "explanation": "Preparation begins with monitoring weather updates.",
    "choices": [
      {
        "text": "Stock up on food and emergency supplies.",
        "is_correct": false
      },
      {
        "text": "Charge flashlights, power banks, and radios.",
        "is_correct": false
      },
      {
        "text": "Stay updated with weather forecasts and advisories.",
        "is_correct": true
      },
      {
        "text": "Secure outdoor items that may be blown away.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Which sentence does NOT belong in a paragraph about road safety?",
    "explanation": "A sentence about gardening is unrelated.",
    "choices": [
      {
        "text": "Pedestrians must use designated crosswalks.",
        "is_correct": false
      },
      {
        "text": "Drivers should always follow traffic signs.",
        "is_correct": false
      },
      {
        "text": "Plants should be watered regularly to stay healthy.",
        "is_correct": true
      },
      {
        "text": "Wearing seatbelts reduces injury during accidents.",
        "is_correct": false
      }
    ]
  },
  {
    "text": "Arrange the sentences in the most coherent order.\nA. They use advanced tools to verify the accuracy of information.\nB. Researchers play a crucial role in generating reliable knowledge.\nC. They then share their findings through reports and publications.\nD. Their work helps society make informed decisions.",
    "explanation": "Correct order: B → A → C → D.",
    "choices": [
      { "text": "BACD", "is_correct": true },
      { "text": "ACBD", "is_correct": false },
      { "text": "CBAD", "is_correct": false },
      { "text": "BDAC", "is_correct": false }
    ]
  },
  {
    "text": "Arrange the sentences to form a clear and logical paragraph.\n\nA. Financial literacy helps individuals manage their money wisely.\nB. It teaches people how to budget, save, and invest.\nC. These skills reduce the risk of debt and financial stress.\nD. As a result, financially literate individuals are more prepared for emergencies.",
    "explanation": "Sentence A introduces the topic, B explains financial literacy, C describes its benefits, and D concludes with the outcome.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-A-C-D", "is_correct": false },
      { "text": "A-C-B-D", "is_correct": false },
      { "text": "C-A-B-D", "is_correct": false }
    ]
  },
  {
    "text": "Choose the correct sentence order.\n\nA. Climate change poses serious risks to global food security.\nB. Rising temperatures affect crop production worldwide.\nC. Extreme weather events further damage agricultural systems.\nD. Addressing climate change is therefore crucial for food sustainability.",
    "explanation": "Sentence A presents the main idea, B and C provide supporting details, and D gives a conclusion.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-C-A-D", "is_correct": false },
      { "text": "A-C-B-D", "is_correct": false },
      { "text": "C-B-A-D", "is_correct": false }
    ]
  },
  {
    "text": "Select the best paragraph arrangement.\n\nA. Proper communication reduces misunderstandings in the workplace.\nB. Clear instructions help employees perform tasks effectively.\nC. Feedback allows workers to improve their performance.\nD. Effective communication contributes to organizational success.",
    "explanation": "Sentence A introduces the topic, B and C explain how communication works, and D summarizes its importance.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-A-C-D", "is_correct": false },
      { "text": "C-B-A-D", "is_correct": false },
      { "text": "A-C-D-B", "is_correct": false }
    ]
  },
  {
    "text": "Which arrangement forms a coherent paragraph?\n\nA. Healthy eating supports overall well-being.\nB. Consuming balanced meals provides essential nutrients.\nC. These nutrients help the body function properly.\nD. Good nutrition reduces the risk of chronic diseases.",
    "explanation": "Sentence A states the main idea, B and C explain it, and D adds an important result.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-C-A-D", "is_correct": false },
      { "text": "A-C-B-D", "is_correct": false },
      { "text": "C-A-B-D", "is_correct": false }
    ]
  },
  {
    "text": "Choose the correct sentence sequence.\n\nA. Transportation systems play a key role in economic development.\nB. Efficient transport enables the movement of goods and people.\nC. This connectivity supports trade and employment opportunities.\nD. Investing in transport infrastructure benefits the economy.",
    "explanation": "Sentence A introduces the topic, B and C explain its role, and D concludes with a benefit.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-A-C-D", "is_correct": false },
      { "text": "C-B-A-D", "is_correct": false },
      { "text": "A-C-B-D", "is_correct": false }
    ]
  },
  {
    "text": "Arrange the sentences logically.\n\nA. Critical thinking helps individuals evaluate information objectively.\nB. It involves analyzing evidence before forming conclusions.\nC. This skill reduces susceptibility to misinformation.\nD. Critical thinking is essential in decision-making processes.",
    "explanation": "Sentence D introduces the topic, A and B explain the skill, and C highlights its benefit.",
    "choices": [
      { "text": "D-A-B-C", "is_correct": true },
      { "text": "A-B-C-D", "is_correct": false },
      { "text": "B-A-D-C", "is_correct": false },
      { "text": "C-A-B-D", "is_correct": false }
    ]
  },
  {
    "text": "Select the best paragraph arrangement.\n\nA. Public transportation reduces traffic congestion in cities.\nB. Fewer private vehicles lead to lower carbon emissions.\nC. This contributes to cleaner air and better public health.\nD. Improving public transport systems benefits urban communities.",
    "explanation": "Sentence D introduces the broad idea, A and B explain its effects, and C concludes with the outcome.",
    "choices": [
      { "text": "D-A-B-C", "is_correct": true },
      { "text": "A-B-C-D", "is_correct": false },
      { "text": "B-A-D-C", "is_correct": false },
      { "text": "C-A-B-D", "is_correct": false }
    ]
  },
  {
    "text": "Which sentence order forms a logical paragraph?\n\nA. Technology improves access to education.\nB. Online platforms allow learners to study remotely.\nC. This flexibility benefits working students and professionals.\nD. Educational technology supports lifelong learning.",
    "explanation": "Sentence A introduces the topic, B explains how it works, C shows who benefits, and D summarizes the idea.",
    "choices": [
      { "text": "A-B-C-D", "is_correct": true },
      { "text": "B-A-C-D", "is_correct": false },
      { "text": "A-C-B-D", "is_correct": false },
      { "text": "C-B-A-D", "is_correct": false }
    ]
  },
  {
    "text": "Choose the correct sentence arrangement.\n\nA. Environmental conservation protects natural resources.\nB. Sustainable practices ensure resources are available for future generations.\nC. Human activities can either harm or preserve ecosystems.\nD. Responsible actions are necessary to maintain ecological balance.",
    "explanation": "Sentence A introduces the topic, C explains human impact, B explains sustainability, and D concludes with responsibility.",
    "choices": [
      { "text": "A-C-B-D", "is_correct": true },
      { "text": "C-A-B-D", "is_correct": false },
      { "text": "A-B-C-D", "is_correct": false },
      { "text": "B-A-C-D", "is_correct": false }
    ]
  },
  {
    "text": "Arrange the sentences to create a coherent paragraph.\n\nA. Lifelong learning helps individuals adapt to change.\nB. Continuous skill development improves employability.\nC. This is important in a rapidly evolving job market.\nD. Learning does not end after formal education.",
    "explanation": "Sentence D introduces the general idea, A explains it, B gives a specific benefit, and C provides context.",
    "choices": [
      { "text": "D-A-B-C", "is_correct": true },
      { "text": "A-B-C-D", "is_correct": false },
      { "text": "B-A-D-C", "is_correct": false },
      { "text": "C-D-A-B", "is_correct": false }
    ]
  }
]
